{
    "AnimeReviewBySeri": [
{
    "object": {
      "title": "Sousou no Frieren",
      "myanimelist_url": "https://myanimelist.net/anime/52991/Sousou_no_Frieren",
      "myanimelist_id": "52991",
      "all_reviews_url": "https://myanimelist.net/anime/52991/Sousou_no_Frieren/reviews",
      "picture_url": "https://cdn.myanimelist.net/images/anime/1015/138006.jpg"
    },
    "user": {
      "name": "chekkit",
      "url": "https://myanimelist.net/profile/chekkit",
      "picture_url": "https://cdn.myanimelist.net/images/userimages/3717363.jpg?t=1744150800"
    },
    "tags": [
      "Recommended\n              "
    ],
    "text": {
      "visible": " I feel so catered to. It feels like an eternity since I've been given such a phenomenal anime with a well thought out plot, great art and animation to accompany it, emotional thought provoking moments... more than that, it feels so mature in that it doesn't baby me with your typical anime tropes. No obnoxiously screaming kid protags, no overly ecchi scenes meant purely for fanservice, no moments where I have to groan and just deal with whatever stupidity is put before me-- Just a fun and emotional journey that is pure story and human feelings. I'm not going to go into too incredible detail, but if ... ",
      "hidden": "you're a fan of fantasy and pure story elements, this is the anime for you. It focuses on the after story of Frieren, who has already well and finished her main quest to defeat the demon lord that plagued their lands. We join her at the end, celebrating the accomplishments of her and the party she traveled with. Time passing ever so swiftly as her party aged while she does not as an elf. She's always known that she will easily outage everyone surrounding her and did not think twice of how she spent her time in those many years till next they met. And then she had to come to face with reality-- The hero she'd traveled with would die. Her compatriots would surely soon follow. Uncaring as she was before, she now realizes just how much she should have bothered to care. Thus does she go on a journey to find herself and to meet up with the others in their older ages. Thus does she take on an apprentice and decide to try and reunite with the hero waiting where they last felled the demon king. What anyone may appreciate most will go into just how well these characters are written. Especially the women! Rarely have I seen a well written woman character that I could fall in love with... and I had just about given up hope in such a male protagonist dominated field. You'll come to appreciate that they're their own characters, with their own thoughts and emotions, with varying personalities and things that get to them in a very human way. Sometimes our emotions don't make sense and occasionally you'll see these characters on their bad days, acting out of sorts and it's interesting to see. Everything from the art, to animation, to music, to details... all of it is wonderful on the eyes and ears. When the going gets tough and the fights begin, the battle choreography is just so gorgeous to watch. So much detail and weight goes into everyone's movement. I think my only possible gripe could be that sometimes the characters can come off as a little stiff, their faces of emotion not as exaggerated when it comes to anime standards. Maybe that's a good thing and we're too accustomed to over the top facial expressions after all this time-- but occasionally, one wonders if it's not just a little too lifeless at times. Other than that nitpick though, I can't help but recommend this anime to all of my friends and share in all its glory! My group of friends were particularly entranced and just so pleased to have a more adult show that felt appropriate for our older age. Just don't go into this expecting it to be fast and getting into this for that quick hit of awesome epic moments. This is a slow ride and an enjoyable one as it builds its world and relationships at a relaxing pace.",
      "full": " I feel so catered to. It feels like an eternity since I've been given such a phenomenal anime with a well thought out plot, great art and animation to accompany it, emotional thought provoking moments... more than that, it feels so mature in that it doesn't baby me with your typical anime tropes. No obnoxiously screaming kid protags, no overly ecchi scenes meant purely for fanservice, no moments where I have to groan and just deal with whatever stupidity is put before me-- Just a fun and emotional journey that is pure story and human feelings. I'm not going to go into too incredible detail, but if ... you're a fan of fantasy and pure story elements, this is the anime for you. It focuses on the after story of Frieren, who has already well and finished her main quest to defeat the demon lord that plagued their lands. We join her at the end, celebrating the accomplishments of her and the party she traveled with. Time passing ever so swiftly as her party aged while she does not as an elf. She's always known that she will easily outage everyone surrounding her and did not think twice of how she spent her time in those many years till next they met. And then she had to come to face with reality-- The hero she'd traveled with would die. Her compatriots would surely soon follow. Uncaring as she was before, she now realizes just how much she should have bothered to care. Thus does she go on a journey to find herself and to meet up with the others in their older ages. Thus does she take on an apprentice and decide to try and reunite with the hero waiting where they last felled the demon king. What anyone may appreciate most will go into just how well these characters are written. Especially the women! Rarely have I seen a well written woman character that I could fall in love with... and I had just about given up hope in such a male protagonist dominated field. You'll come to appreciate that they're their own characters, with their own thoughts and emotions, with varying personalities and things that get to them in a very human way. Sometimes our emotions don't make sense and occasionally you'll see these characters on their bad days, acting out of sorts and it's interesting to see. Everything from the art, to animation, to music, to details... all of it is wonderful on the eyes and ears. When the going gets tough and the fights begin, the battle choreography is just so gorgeous to watch. So much detail and weight goes into everyone's movement. I think my only possible gripe could be that sometimes the characters can come off as a little stiff, their faces of emotion not as exaggerated when it comes to anime standards. Maybe that's a good thing and we're too accustomed to over the top facial expressions after all this time-- but occasionally, one wonders if it's not just a little too lifeless at times. Other than that nitpick though, I can't help but recommend this anime to all of my friends and share in all its glory! My group of friends were particularly entranced and just so pleased to have a more adult show that felt appropriate for our older age. Just don't go into this expecting it to be fast and getting into this for that quick hit of awesome epic moments. This is a slow ride and an enjoyable one as it builds its world and relationships at a relaxing pace. "
    },
    "date": {
      "date_str": "Mar 22, 2024",
      "time_str": "12:40 PM",
      "timestamp": 1711111200000
    }
},
{
    "object": {
      "title": "Sousou no Frieren",
      "myanimelist_url": "https://myanimelist.net/anime/52991/Sousou_no_Frieren",
      "myanimelist_id": "52991",
      "all_reviews_url": "https://myanimelist.net/anime/52991/Sousou_no_Frieren/reviews",
      "picture_url": "https://cdn.myanimelist.net/images/anime/1015/138006.jpg"
    },
    "user": {
      "name": "CaptainKenshiro",
      "url": "https://myanimelist.net/profile/CaptainKenshiro",
      "picture_url": "https://cdn.myanimelist.net/images/userimages/5771839.jpg?t=1744168800"
    },
    "tags": [
      "Mixed Feelings\n              ",
      "Funny"
    ],
    "text": {
      "visible": " Someone recommended me to watch this title last year months before it began airing as a similar series to Mahoutsukai no Yome, and although it also has a mage and their disciple studying, training and traveling together, and the main characters share voice actress, I don’t see much resemblance beyond the premise. Concept wise, I find it to be more similar to Fumetsu no Anata E, since it is about a long-lived non-human protagonist learning about mortality and the short live span of humans while traveling around the world and getting some friends and new abilities. The issues with that title are that the protagonist ... ",
      "hidden": "didn’t have a personality initially, it was full of emotional manipulation to make you cry, the main character was becoming stronger by acquiring the abilities of his dead friends, thus coming off as feeding off of them, the secondary cast got a lot of focus on their mini arc and then disappeared from the story completely, essentially wasting time and screentime, and the protagonist changed completely after a time skip. That’s where I dropped that show but from what I understand afterwards the series mutates from a road movie type of drama to a fighting shounen which in turn drops tremendously in visual quality. Frieren doesn’t have those issues. To start off, the animation is pretty good for the most part, there are some weak moments in the artwork and backgrounds but they are usually consistent and very good, even if typical for a fantasy series. The lighting and shading as well as the rest of the special effects are very good, except for the offensive spell that some charracters use, I don’t know why but that looks very outdated. The character designs are very simple and even kind of childish, which are not bad but kind of unfitting at first with the melancholic feeling of the show. The motions are very good at every moment, even the most relaxing ones, each character even has their own distinct way of walking, the facial expressions are very varied and well done, and the action scenes tend to use dynamic movement, like Burn the Witch, Majo no Tabitabi, Akudama Drive and some others did in 2020, and Trigun: Stampede did last year. Overall it’s pretty good in that regard, even if it doesn’t compare with Shangri-la Frontier and Kusuriya no Hitorigoto, which were airing at the same time. The presentation is good, it’s just that the aesthetics are nothing special. Same thing applies to the audio department, the sound effects are really good and impactful and not too loud and not saturated, the voice acting is ok, nothing special. The soundtrack is really fitting, it’s just typical background music for a fantasy show but it’s very well done and at times even absorbing. The ending song and the insert song (to my understanding, used as an ending for an early screening), both by Milet fit the series really well and are quite beautiful on their own, and the lyrics go very well with the anime. The openings are not as good but the second one is better than the first, which although it had good lyrics for the story, it was strangely upbeat for this time of anime, and thus didn’t fit very well. The second one had a little more energy as well, but at least it felt more appropriate for the second half of the series. Characterization is not the strongest aspect of the anime, the main characters have a name with a specific meaning, and their whole characterization is based around that, in anime terms, the two female are basically kuuderes and the male is the typical kind hearted but misunderstood and poorly treated harem lead. No, I’m not saying nor implying this series is a harem, I’m just saying that the characters fit some of those archetypes, and although that makes them easy to remember because of that, they don’t have very elaborate nor complicating personalities for the same reason. What they do have, however, is backdrop stories good enough to flesh them out instead of just leaving them as dry archetypes, and they more or less serve to explain the way the characters are. More and more background information about them is revealed and they also come to learn more things about the previous important party, as it also does the audience that way. People really seem to like the possible romantic dynamic between two members of the party, I personally don’t give a shit about that, the boy is kind but treated poorly by the girl for no reason besides “comedy”. I’ve seen the same dynamic in anime from the 90s and 00s and got tired of it. At least she recognizes later on that she was acting like a brat and they become friendlier with one another afterwards, and for some people they seem to be “couple goals” or some shit like that, I don’t really care. What’s important is that even the basic main cast here is better than the rock turned wolf turned boy from Fumetsu, he couldn’t even talk, he had no personality nor backdrop, and he changed completely after a time skip, thus that doesn’t count as organic character development. This anime has time skips as well but they are nowhere near as big, they don’t skip the scenes of characters learning new things, especially for the main one Frieren, who comes to realize, she knew and was closer to her original party than she always thought and she gains a purpose in life by doing what they want her to do after they died at the beginning of the story, and it all happens on screen, not between time skips. It’s even related to the themes, despite being one of the most important heroes in history, Frieren never stood out and never truly cared for anyone else, she never had ambition and never understood how brief a human life could be for an elf like her, until she found out when trying to reunite with her old party, that’s when it clicked in and when she notices that she always took that time for granted and regrets not spending more time with them or getting to know them now that there is no going back. The rest of the series she dedicates to fulfill the last wishes of her old party and recall old times in their adventure, thus coming to realize she knew and cared more about them that she ever considered to, while also collecting some more magic here and there. That way, the series also has the chance to flesh out the older support cast that dies early on through flashbacks, and I also realized where the main appeal and value of the series might be, as a sort of company of sorts for people who have recently lost someone and regret not spending enough time with them. Sousou no Frieren is not a tearjerker however, the drama is presented more in a melancholic tone than anything else, which is something I appreciate about it, considering that there are so many shows out there filled with emotional manipulation. The other mains are fine on their own, they also get flashbacks and learn new things and like I said they become closer with each other, it’s just that the focus is clearly on the protagonist, so they come off as simpler and more inferior characters, especially the guy who gets completely sidelined in the second half. Also, compared to that other series, Sousou no Frieren is clear about what it is from the very beginning. There is some action here and there and is usually well animated, directed, choreographed and has some tactics here and there, but for the most part it’s a lighthearted road movie type of fantasy adventure where the character we follow through for the whole show is the strongest, thus the stakes are low. She might not be the most powerful in-series, but we only know that thanks to some throwaway lines, we never really get a sense of urgency or that Frieren might lose or struggle against someone. It’s a show meant to relax to and look back at some of your past relationships, with some magical beams thrown around from time to time for flavour. Some other things I want to praise the writing for is caring about some very specific things that add to characterization and world building despite being such small details. First, since elves are so long-lived, they get easily emotionally detached from everyone else, they don’t have strong feelings for anyone, neither romantic nor sexual, and that’s why there are few of them and why the protagonist herself is so cold at first. It also helps to explain why, despite being one of the most well-known heroes in history, no one seems to recognize her at first, like Luffy in One Piece, but here is far more believable because the setting doesn’t have the same technology and the main character herself does as much as she can to keep a low profile. Another good detail is the explaining for why there isn’t any transportation magic and for why flying magic is limited, which also forces the main cast to actually travel through the fucking setting, whereas other series have several ways for the main cast to be where they need to be when the plot requires them to. This also helps in making the anime feel like, well, an adventure, because how can you have a proper adventure if there is no adventuring, no travelling, no exploring the setting? It’s not like Sousou no Frieren has a world that needs much building nor explaining, it’s a very typical fantasy setting with typical classes, creatures and archetypes, but at least is properly written and established, and it is actually explored, while it also doesn’t function like an RPG, how many other modern fantasy anime can claim the same, eh? That’s why the characters can’t just go wherever they want and in any ways they would like, every city and every place has its rules, and since Frieren herself knows the route well, you get a bit of lore or history from them, having the rest of the party going on their first adventure also helps, since that way the author has a reason for all the explaining to be done, the exposition is excused. Not to say that this anime is perfect of course, since there is no clear reasoning why, despite magic evolving so much for being studied for decades and even centuries, basic spells still work the best against newer, supposedly better instructed mages, or why the only mages that know how to control and repress mana in-series are the ones related in some way to the main character. Then, the whole thing about Frieren kind of falls apart when you consider, “wait, wasn’t her teacher a human? Doesn’t that go against her whole character arc and the main theme of the show?” And the answer from me is yes, I have no excuse for that, and consider it a big flaw in the writing. Likewise, the second half of the show is inferior than the first, exactly because it falls for the same issues as the series I compared it to. It is a tournament/exam arc that you would find in an action shounen instead of this one, it completely sidelines an important character, and although needed for the characters to keep going, the plot stops progressing completely for a lot of episodes instead of the mini adventures from earlier, and there are a lot of unimportant secondary characters getting a lot of rushed focus. Other series do that as well (Dragon Ball, Hunter x Hunter, Naruto, Yu Yu Hakusho) but being long fighting shounen, their characters don’t disappear completely from the story until way later. I’m an anime only here, thus I can’t tell if someone from the second cour is coming back at some point or not, but I hardly doubt it and I’m sure they don’t join the main party, essentially meaning that for at least this first season, they work against the plot by killing time and taking screentime for no reason. With that said, it’s not straight up bad, since there are still moments to flesh out the two main girls and see them interacting, and there is still some cool action from time to time. And also, well, there is hardly any plot in here, it’s just low on action and stakes basic traveling and adventuring with an overpowered protagonist that goofs around before solving most things thanks to how powerful or experienced she is, and although I like that she is kind of like Maomao from Kusuriya no Hitorigoto, neither an idealistic hot headed idiot typical shounen protagonist, nor an asshole that doesn’t give a shit about people like Elaina from Majo no Tabitabi, she still doesn’t actually do or not most things on her own wish, that’s why she says things like “Himmel would scold me if I did that” or “Himmel would praise me if I do this”. Thus, despite part of me respecting the value and appeal it might have for some emotional people and for how mostly well established the writing and presentation are, the cynical bastard I am only finds boredom in here, because there isn’t much plot, the characters are simple, the stakes are low because the protagonist is overpowered, the plot devices are not the type of which I’m usually thrilled about, the setting is basic, the energy is low, the aesthetics are simple, and the second half, although it still fleshes out two of the main characters, is inferior than the first by falling for the usual meh writing of other shows. In the end I consider it a decent relaxing time passer that can be very appealing for some viewers, but nowhere near as good as the general consensus says it is, and a complete chore to watch for part of the audience, myself included. At least I can say that this anime doesn’t have recaps neither inside nor outside the episode count, which is more than I can say about the other shows I was following at the same time.",
      "full": " Someone recommended me to watch this title last year months before it began airing as a similar series to Mahoutsukai no Yome, and although it also has a mage and their disciple studying, training and traveling together, and the main characters share voice actress, I don’t see much resemblance beyond the premise. Concept wise, I find it to be more similar to Fumetsu no Anata E, since it is about a long-lived non-human protagonist learning about mortality and the short live span of humans while traveling around the world and getting some friends and new abilities. The issues with that title are that the protagonist ... didn’t have a personality initially, it was full of emotional manipulation to make you cry, the main character was becoming stronger by acquiring the abilities of his dead friends, thus coming off as feeding off of them, the secondary cast got a lot of focus on their mini arc and then disappeared from the story completely, essentially wasting time and screentime, and the protagonist changed completely after a time skip. That’s where I dropped that show but from what I understand afterwards the series mutates from a road movie type of drama to a fighting shounen which in turn drops tremendously in visual quality. Frieren doesn’t have those issues. To start off, the animation is pretty good for the most part, there are some weak moments in the artwork and backgrounds but they are usually consistent and very good, even if typical for a fantasy series. The lighting and shading as well as the rest of the special effects are very good, except for the offensive spell that some charracters use, I don’t know why but that looks very outdated. The character designs are very simple and even kind of childish, which are not bad but kind of unfitting at first with the melancholic feeling of the show. The motions are very good at every moment, even the most relaxing ones, each character even has their own distinct way of walking, the facial expressions are very varied and well done, and the action scenes tend to use dynamic movement, like Burn the Witch, Majo no Tabitabi, Akudama Drive and some others did in 2020, and Trigun: Stampede did last year. Overall it’s pretty good in that regard, even if it doesn’t compare with Shangri-la Frontier and Kusuriya no Hitorigoto, which were airing at the same time. The presentation is good, it’s just that the aesthetics are nothing special. Same thing applies to the audio department, the sound effects are really good and impactful and not too loud and not saturated, the voice acting is ok, nothing special. The soundtrack is really fitting, it’s just typical background music for a fantasy show but it’s very well done and at times even absorbing. The ending song and the insert song (to my understanding, used as an ending for an early screening), both by Milet fit the series really well and are quite beautiful on their own, and the lyrics go very well with the anime. The openings are not as good but the second one is better than the first, which although it had good lyrics for the story, it was strangely upbeat for this time of anime, and thus didn’t fit very well. The second one had a little more energy as well, but at least it felt more appropriate for the second half of the series. Characterization is not the strongest aspect of the anime, the main characters have a name with a specific meaning, and their whole characterization is based around that, in anime terms, the two female are basically kuuderes and the male is the typical kind hearted but misunderstood and poorly treated harem lead. No, I’m not saying nor implying this series is a harem, I’m just saying that the characters fit some of those archetypes, and although that makes them easy to remember because of that, they don’t have very elaborate nor complicating personalities for the same reason. What they do have, however, is backdrop stories good enough to flesh them out instead of just leaving them as dry archetypes, and they more or less serve to explain the way the characters are. More and more background information about them is revealed and they also come to learn more things about the previous important party, as it also does the audience that way. People really seem to like the possible romantic dynamic between two members of the party, I personally don’t give a shit about that, the boy is kind but treated poorly by the girl for no reason besides “comedy”. I’ve seen the same dynamic in anime from the 90s and 00s and got tired of it. At least she recognizes later on that she was acting like a brat and they become friendlier with one another afterwards, and for some people they seem to be “couple goals” or some shit like that, I don’t really care. What’s important is that even the basic main cast here is better than the rock turned wolf turned boy from Fumetsu, he couldn’t even talk, he had no personality nor backdrop, and he changed completely after a time skip, thus that doesn’t count as organic character development. This anime has time skips as well but they are nowhere near as big, they don’t skip the scenes of characters learning new things, especially for the main one Frieren, who comes to realize, she knew and was closer to her original party than she always thought and she gains a purpose in life by doing what they want her to do after they died at the beginning of the story, and it all happens on screen, not between time skips. It’s even related to the themes, despite being one of the most important heroes in history, Frieren never stood out and never truly cared for anyone else, she never had ambition and never understood how brief a human life could be for an elf like her, until she found out when trying to reunite with her old party, that’s when it clicked in and when she notices that she always took that time for granted and regrets not spending more time with them or getting to know them now that there is no going back. The rest of the series she dedicates to fulfill the last wishes of her old party and recall old times in their adventure, thus coming to realize she knew and cared more about them that she ever considered to, while also collecting some more magic here and there. That way, the series also has the chance to flesh out the older support cast that dies early on through flashbacks, and I also realized where the main appeal and value of the series might be, as a sort of company of sorts for people who have recently lost someone and regret not spending enough time with them. Sousou no Frieren is not a tearjerker however, the drama is presented more in a melancholic tone than anything else, which is something I appreciate about it, considering that there are so many shows out there filled with emotional manipulation. The other mains are fine on their own, they also get flashbacks and learn new things and like I said they become closer with each other, it’s just that the focus is clearly on the protagonist, so they come off as simpler and more inferior characters, especially the guy who gets completely sidelined in the second half. Also, compared to that other series, Sousou no Frieren is clear about what it is from the very beginning. There is some action here and there and is usually well animated, directed, choreographed and has some tactics here and there, but for the most part it’s a lighthearted road movie type of fantasy adventure where the character we follow through for the whole show is the strongest, thus the stakes are low. She might not be the most powerful in-series, but we only know that thanks to some throwaway lines, we never really get a sense of urgency or that Frieren might lose or struggle against someone. It’s a show meant to relax to and look back at some of your past relationships, with some magical beams thrown around from time to time for flavour. Some other things I want to praise the writing for is caring about some very specific things that add to characterization and world building despite being such small details. First, since elves are so long-lived, they get easily emotionally detached from everyone else, they don’t have strong feelings for anyone, neither romantic nor sexual, and that’s why there are few of them and why the protagonist herself is so cold at first. It also helps to explain why, despite being one of the most well-known heroes in history, no one seems to recognize her at first, like Luffy in One Piece, but here is far more believable because the setting doesn’t have the same technology and the main character herself does as much as she can to keep a low profile. Another good detail is the explaining for why there isn’t any transportation magic and for why flying magic is limited, which also forces the main cast to actually travel through the fucking setting, whereas other series have several ways for the main cast to be where they need to be when the plot requires them to. This also helps in making the anime feel like, well, an adventure, because how can you have a proper adventure if there is no adventuring, no travelling, no exploring the setting? It’s not like Sousou no Frieren has a world that needs much building nor explaining, it’s a very typical fantasy setting with typical classes, creatures and archetypes, but at least is properly written and established, and it is actually explored, while it also doesn’t function like an RPG, how many other modern fantasy anime can claim the same, eh? That’s why the characters can’t just go wherever they want and in any ways they would like, every city and every place has its rules, and since Frieren herself knows the route well, you get a bit of lore or history from them, having the rest of the party going on their first adventure also helps, since that way the author has a reason for all the explaining to be done, the exposition is excused. Not to say that this anime is perfect of course, since there is no clear reasoning why, despite magic evolving so much for being studied for decades and even centuries, basic spells still work the best against newer, supposedly better instructed mages, or why the only mages that know how to control and repress mana in-series are the ones related in some way to the main character. Then, the whole thing about Frieren kind of falls apart when you consider, “wait, wasn’t her teacher a human? Doesn’t that go against her whole character arc and the main theme of the show?” And the answer from me is yes, I have no excuse for that, and consider it a big flaw in the writing. Likewise, the second half of the show is inferior than the first, exactly because it falls for the same issues as the series I compared it to. It is a tournament/exam arc that you would find in an action shounen instead of this one, it completely sidelines an important character, and although needed for the characters to keep going, the plot stops progressing completely for a lot of episodes instead of the mini adventures from earlier, and there are a lot of unimportant secondary characters getting a lot of rushed focus. Other series do that as well (Dragon Ball, Hunter x Hunter, Naruto, Yu Yu Hakusho) but being long fighting shounen, their characters don’t disappear completely from the story until way later. I’m an anime only here, thus I can’t tell if someone from the second cour is coming back at some point or not, but I hardly doubt it and I’m sure they don’t join the main party, essentially meaning that for at least this first season, they work against the plot by killing time and taking screentime for no reason. With that said, it’s not straight up bad, since there are still moments to flesh out the two main girls and see them interacting, and there is still some cool action from time to time. And also, well, there is hardly any plot in here, it’s just low on action and stakes basic traveling and adventuring with an overpowered protagonist that goofs around before solving most things thanks to how powerful or experienced she is, and although I like that she is kind of like Maomao from Kusuriya no Hitorigoto, neither an idealistic hot headed idiot typical shounen protagonist, nor an asshole that doesn’t give a shit about people like Elaina from Majo no Tabitabi, she still doesn’t actually do or not most things on her own wish, that’s why she says things like “Himmel would scold me if I did that” or “Himmel would praise me if I do this”. Thus, despite part of me respecting the value and appeal it might have for some emotional people and for how mostly well established the writing and presentation are, the cynical bastard I am only finds boredom in here, because there isn’t much plot, the characters are simple, the stakes are low because the protagonist is overpowered, the plot devices are not the type of which I’m usually thrilled about, the setting is basic, the energy is low, the aesthetics are simple, and the second half, although it still fleshes out two of the main characters, is inferior than the first by falling for the usual meh writing of other shows. In the end I consider it a decent relaxing time passer that can be very appealing for some viewers, but nowhere near as good as the general consensus says it is, and a complete chore to watch for part of the audience, myself included. At least I can say that this anime doesn’t have recaps neither inside nor outside the episode count, which is more than I can say about the other shows I was following at the same time. "
    },
    "date": {
      "date_str": "Mar 22, 2024",
      "time_str": "10:29 AM",
      "timestamp": 1711103340000
    }
},
{
    "object": {
      "title": "Sousou no Frieren",
      "myanimelist_url": "https://myanimelist.net/anime/52991/Sousou_no_Frieren",
      "myanimelist_id": "52991",
      "all_reviews_url": "https://myanimelist.net/anime/52991/Sousou_no_Frieren/reviews",
      "picture_url": "https://cdn.myanimelist.net/images/anime/1015/138006.jpg"
    },
    "user": {
      "name": "Trikkiez",
      "url": "https://myanimelist.net/profile/Trikkiez",
      "picture_url": "https://cdn.myanimelist.net/images/userimages/11787545.jpg?t=1744135800"
    },
    "tags": [
      "Not Recommended\n              ",
      "Funny"
    ],
    "text": {
      "visible": " Style-\nFrieren doesn't have its own unique style in any way. It just feels like every other Fantasy/Isekai ever. and I know it's not an Isekai, but it certainly feels like it in a lot of ways. The characters are very uninteresting and forgettable, the ost is one of the most generic things I've ever heard, the directing is very basic and boring, and the world is also uninteresting and forgettable. It's ironic how the only intriguing location is one we never see on screen through the whole anime (The North). Besides that there isn't a single location that sticks out. So in terms of ... ",
      "hidden": "style this anime offers nothing that anybody who has seen more than 20 anime likely hasn't already seen before. It's not ambitious in any way and just feels soulless. I will say that for an anime to be good it doesn't have to be avant garde, or have insane directing that blows your mind, but there is nothing this anime offers that even makes up for its lack of identity (boring soulless characters and world). World Building- I've seen so many people praising the \"amazing world building\" this anime has, but I don't understand where they are getting this from. The actual locations they go to feel like they have little to no importance in the actual world. They just feel like random kingdoms and villages, but why are these kingdoms actually important in the world? We are never really told, so it kind of just feels like they are just there to give the characters a place to go. it makes the world feel less alive and less dynamic. The world isn't changing around our characters, but rather they are changing around the world. It makes watching them journey around random areas feel meaningless. I never once during this anime thought to myself about where the characters would go next, nor did any area feel distinct from each other. There was nothing differentiating the different areas culturally and it just made the anime really boring and feel not alive. There was never a single character we met in one of these areas that wasn't also forgettable. The world we are in is also so incredibly stereotypical. The fantasy elements aren't creative in any way and they just feel like copies of the same blueprint that fantasy stories have been using for a long time. Even Konosuba was parodying these stereotypes over 10 years ago but yet we are seeing them even more now for some reason. Regardless, Frieren does nothing interesting with these elements. The magic system is generic, the Demons are just bad guys who want to kill people, the kingdoms and villages are all generic, and I can go on and on. It just felt like this anime had a checklist of fantasy setting elements to include, but didn't bother to do anything interesting with any of them. The magic system is poorly implemented as well. Why doesn't pretty much everyone in the world use magic? It's such an advanced tool that I feel like everyone even people doing basic jobs should use it to make their jobs more efficient. It isn't a very well thought out concept and it goes back to what I was saying earlier about how they just included it because that's the norm for fantasy stories. Animation/Art/Directing/Soundtrack\nThis is the strongest part of the whole anime. The animation was insane sometimes and there were lots of pretty colors that I actually liked looking at. Animation is such a non factor though this barely added anything to the experience for me. This is probably the least important category when it comes to making a good anime. As far as the art goes, I thought the background scenery was overly generic a lot of the time. Once again, it felt like I couldn't separate it from anything else. It didn't feel very atmospherically alive, but if it did I think I would've liked it a lot more. If this anime was more like Mushishi for example where each scene is just breathing life, I would've appreciated it so much more. In Mushishi there is always so much going on in the background and environmentally, even when nothing is happening it creates such a nice watching environment, that I am just completely entranced. It feels like this is what this anime wanted to be, but failed miserably. The lack of an interesting soundtrack also plays a heavy role in this. There were times where it actually felt like the soundtrack was AI generated.\nThe directing was very boring and there were a lot of annoying flashbacks that happened in the middle of a fight. Sometimes I literally forgot the fight was even happening because of how long the flashbacks were, which is where the problem lies for me. There is nothing wrong with the flashbacks inherently, but they were just very annoying and uninterestingly implemented. There were some scenes where a monster or demon would die, and for some reason they would randomly dissolve as if it was a video game or something. And there is also an annoying amount of explosions in this anime. To the point where explosions pretty much mean nothing since there is one every 3 minutes on average. Even when nothing happens to cause an explosion, one will just randomly happen anyways. There were a lot of questionable sound design choices surrounding the comedy scenes that took me out of whatever immersion I possibly had left. They would use silly sound effects that didn't fit in the actual world and it felt really off putting. However, as for my first positive in this whole review, I actually really love the crystally sound effect they use whenever a character uses magic. It actually sounded really cool and it was probably my favorite part of the whole anime. Comedy- This anime does a poor job at mixing in its comedy with seriousness. There is one episode where Stark is bitten by a venomous snake and he was on the edge of potentially dying. Yet, the characters were being very unserious about it, as if it didn't even matter. There were many instances of this during the anime and it just got unwatchable. How am I supposed to take this anime seriously when even the people making it aren't taking it seriously. Besides that a lot of the comedy feels like it was written by a 13 year old. The jokes just felt very forced in, and it often repeats jokes a lot as if us hearing about the drunk priest again for the 50th time was gonna be any more funny than the 49th time. A lot of the characters are purely used as comedy sticks and don't even feel like their own person. Pretty much the entire cast of Frierens old group are 1 dimensional comedy characters that got carried by Frieren to defeating the demon king. The priest is drunk every time we see him in a flashback, himmel is always acting like an idiot which is supposed to be funny because he's actually supposed to be like a hero or something, but he actually is just a goofball (its funny and stark is totally not the same character), and the beard guy never talks and is pretty much just afk. Oh and if one drunk priest wasn't enough, we get a second one midway through the anime. Characters- None of the characters feel like humans. They are constantly expressionless, especially during fights, and it just makes them very unrelatable. The way they talk is robotic as well. It's annoying that our main 2 characters are the most expressionless in the whole anime, and of course they get the most screen time. I already talked about the other characters from Frierens flashbacks, and that applies here too. Most of the characters are either expressionless robots, or purely comedy characters. There are very few actually serious characters and when I say very few I mean only 2. There is no character development, and everyone stays the same as they were before. After Stark defeats the dragon on his own early on, he doesn't grow as a character, he just stays as an annoying whiny brat. Fern is always mad at stark, even when their relationship progresses, it always goes back to square 1 and nothing ever happens to progress anything really. Plot- Boring, nothing happens between episodes 10-18. There isn't really much to talk about because there isn't really much plot to begin with. Frieren is kind of just looking after Fern because the drunk priest wanted to and they just wander around together. That's pretty much it. I guess they have an objective to go up to the north so they spend 18 episodes doing nothing, and then doing an exam so that they can try becoming tier 1 mages to go up north. It's very boring and nothing happened this entire season. This anime is more about its themes than its plot but I think the themes aren't explored very well. I did resonate with them a lot early on, but the same themes of nostalgia and time perception got really repetitive and they never really went anywhere. In conclusion, this anime is not good in any way and honestly I gave it the most positive rating I could've possibly given it. I was bored from start to finish, and there was very little redeeming qualities in this anime. The only reason I didn't rate this anime lower is because I think there are much worse anime out there and in comparison to those, I guess this one isn't the worst thing ever, but it probably deserves a 2 or a 3 in reality. This anime is full of plot conveniences and nonsense. If you would like to see more of what I thought about this anime, feel free to check out the youtube channel in my bio. I uploaded a full length review on this anime where I talk about a lot of the things I wrote here, as well as a lot of other things I didn't go into depth about.",
      "full": " Style-\nFrieren doesn't have its own unique style in any way. It just feels like every other Fantasy/Isekai ever. and I know it's not an Isekai, but it certainly feels like it in a lot of ways. The characters are very uninteresting and forgettable, the ost is one of the most generic things I've ever heard, the directing is very basic and boring, and the world is also uninteresting and forgettable. It's ironic how the only intriguing location is one we never see on screen through the whole anime (The North). Besides that there isn't a single location that sticks out. So in terms of ... style this anime offers nothing that anybody who has seen more than 20 anime likely hasn't already seen before. It's not ambitious in any way and just feels soulless. I will say that for an anime to be good it doesn't have to be avant garde, or have insane directing that blows your mind, but there is nothing this anime offers that even makes up for its lack of identity (boring soulless characters and world). World Building- I've seen so many people praising the \"amazing world building\" this anime has, but I don't understand where they are getting this from. The actual locations they go to feel like they have little to no importance in the actual world. They just feel like random kingdoms and villages, but why are these kingdoms actually important in the world? We are never really told, so it kind of just feels like they are just there to give the characters a place to go. it makes the world feel less alive and less dynamic. The world isn't changing around our characters, but rather they are changing around the world. It makes watching them journey around random areas feel meaningless. I never once during this anime thought to myself about where the characters would go next, nor did any area feel distinct from each other. There was nothing differentiating the different areas culturally and it just made the anime really boring and feel not alive. There was never a single character we met in one of these areas that wasn't also forgettable. The world we are in is also so incredibly stereotypical. The fantasy elements aren't creative in any way and they just feel like copies of the same blueprint that fantasy stories have been using for a long time. Even Konosuba was parodying these stereotypes over 10 years ago but yet we are seeing them even more now for some reason. Regardless, Frieren does nothing interesting with these elements. The magic system is generic, the Demons are just bad guys who want to kill people, the kingdoms and villages are all generic, and I can go on and on. It just felt like this anime had a checklist of fantasy setting elements to include, but didn't bother to do anything interesting with any of them. The magic system is poorly implemented as well. Why doesn't pretty much everyone in the world use magic? It's such an advanced tool that I feel like everyone even people doing basic jobs should use it to make their jobs more efficient. It isn't a very well thought out concept and it goes back to what I was saying earlier about how they just included it because that's the norm for fantasy stories. Animation/Art/Directing/Soundtrack\nThis is the strongest part of the whole anime. The animation was insane sometimes and there were lots of pretty colors that I actually liked looking at. Animation is such a non factor though this barely added anything to the experience for me. This is probably the least important category when it comes to making a good anime. As far as the art goes, I thought the background scenery was overly generic a lot of the time. Once again, it felt like I couldn't separate it from anything else. It didn't feel very atmospherically alive, but if it did I think I would've liked it a lot more. If this anime was more like Mushishi for example where each scene is just breathing life, I would've appreciated it so much more. In Mushishi there is always so much going on in the background and environmentally, even when nothing is happening it creates such a nice watching environment, that I am just completely entranced. It feels like this is what this anime wanted to be, but failed miserably. The lack of an interesting soundtrack also plays a heavy role in this. There were times where it actually felt like the soundtrack was AI generated.\nThe directing was very boring and there were a lot of annoying flashbacks that happened in the middle of a fight. Sometimes I literally forgot the fight was even happening because of how long the flashbacks were, which is where the problem lies for me. There is nothing wrong with the flashbacks inherently, but they were just very annoying and uninterestingly implemented. There were some scenes where a monster or demon would die, and for some reason they would randomly dissolve as if it was a video game or something. And there is also an annoying amount of explosions in this anime. To the point where explosions pretty much mean nothing since there is one every 3 minutes on average. Even when nothing happens to cause an explosion, one will just randomly happen anyways. There were a lot of questionable sound design choices surrounding the comedy scenes that took me out of whatever immersion I possibly had left. They would use silly sound effects that didn't fit in the actual world and it felt really off putting. However, as for my first positive in this whole review, I actually really love the crystally sound effect they use whenever a character uses magic. It actually sounded really cool and it was probably my favorite part of the whole anime. Comedy- This anime does a poor job at mixing in its comedy with seriousness. There is one episode where Stark is bitten by a venomous snake and he was on the edge of potentially dying. Yet, the characters were being very unserious about it, as if it didn't even matter. There were many instances of this during the anime and it just got unwatchable. How am I supposed to take this anime seriously when even the people making it aren't taking it seriously. Besides that a lot of the comedy feels like it was written by a 13 year old. The jokes just felt very forced in, and it often repeats jokes a lot as if us hearing about the drunk priest again for the 50th time was gonna be any more funny than the 49th time. A lot of the characters are purely used as comedy sticks and don't even feel like their own person. Pretty much the entire cast of Frierens old group are 1 dimensional comedy characters that got carried by Frieren to defeating the demon king. The priest is drunk every time we see him in a flashback, himmel is always acting like an idiot which is supposed to be funny because he's actually supposed to be like a hero or something, but he actually is just a goofball (its funny and stark is totally not the same character), and the beard guy never talks and is pretty much just afk. Oh and if one drunk priest wasn't enough, we get a second one midway through the anime. Characters- None of the characters feel like humans. They are constantly expressionless, especially during fights, and it just makes them very unrelatable. The way they talk is robotic as well. It's annoying that our main 2 characters are the most expressionless in the whole anime, and of course they get the most screen time. I already talked about the other characters from Frierens flashbacks, and that applies here too. Most of the characters are either expressionless robots, or purely comedy characters. There are very few actually serious characters and when I say very few I mean only 2. There is no character development, and everyone stays the same as they were before. After Stark defeats the dragon on his own early on, he doesn't grow as a character, he just stays as an annoying whiny brat. Fern is always mad at stark, even when their relationship progresses, it always goes back to square 1 and nothing ever happens to progress anything really. Plot- Boring, nothing happens between episodes 10-18. There isn't really much to talk about because there isn't really much plot to begin with. Frieren is kind of just looking after Fern because the drunk priest wanted to and they just wander around together. That's pretty much it. I guess they have an objective to go up to the north so they spend 18 episodes doing nothing, and then doing an exam so that they can try becoming tier 1 mages to go up north. It's very boring and nothing happened this entire season. This anime is more about its themes than its plot but I think the themes aren't explored very well. I did resonate with them a lot early on, but the same themes of nostalgia and time perception got really repetitive and they never really went anywhere. In conclusion, this anime is not good in any way and honestly I gave it the most positive rating I could've possibly given it. I was bored from start to finish, and there was very little redeeming qualities in this anime. The only reason I didn't rate this anime lower is because I think there are much worse anime out there and in comparison to those, I guess this one isn't the worst thing ever, but it probably deserves a 2 or a 3 in reality. This anime is full of plot conveniences and nonsense. If you would like to see more of what I thought about this anime, feel free to check out the youtube channel in my bio. I uploaded a full length review on this anime where I talk about a lot of the things I wrote here, as well as a lot of other things I didn't go into depth about. "
    },
    "date": {
      "date_str": "Mar 24, 2024",
      "time_str": "2:03 AM",
      "timestamp": 1711245780000
    }
}
]
}